Repository: yannHippert/LP-Flutter-Shop
Catalog: FlutterApp/lib/l10n/app_*.arb
Languages: fr

source: Password
fr: Mot de passe

# email_placeholder
source: Enter your email
fr: Entrez votre email

# password_placeholder
source: Enter your password
fr: Entrez votre mot de passe

source: Login
fr: Connecter

source: Logout
fr: Déconnecter

source: Account
fr: Compte

source: Product
fr: Produit

source: Prodcuts
fr: Produits

source: Order
fr: Commande

source: Orders
fr: Commandes

source: Shippingfee
fr: Frais de ports

source: Language
fr: Langue

source: Delete
fr: Supprimer

source: Confirm payment
fr: Confirmer le paiement

source: Welcome back!
fr: Bienvenue !

# user_loggedin
source: You have been logged in
fr: Vous avez été connecté

# user_loggedout
source: You have been logged out
fr: Vous avez été déconnecté

source: Add to basket
fr: Ajouter au panier

# added_to_basket
source: Added product to basket
fr: Ajouté au panier

source: {item} added to basket
fr: {item} ajouté au panier

source: Add to wishlist
fr: Ajouter à la liste de souhaits

# added_to_wishlist
source: Added product to wishlist
fr: Ajouté la liste de souhaits

source: {item} added to wishlist
fr: {item} ajouté à la liste de souhaits

source: Move to wishlist
fr: Déplacer vers la liste de souhaits

source: Remove from wishlist
fr: Retirer de la liste de souhaits

# removed_from_wishlist
source: Removed product from wishlist
fr: Retirer le produit de la liste de souhaits

source: {item} removed from wishlist
fr: {item} retiré de la liste de souhaits

# login_to_shop
source: Please login to buy items
fr: Veuillez vous connecter pour acheter des articles

# empty_basket
source: You haven't added any items to your basket yet
fr: Vous n'avez pas encore ajouté d'articles à votre panier

# empty_wishlist
source: No products in your wishlist
fr: Aucun produit dans votre liste de souhaits

# no_orders_yet
source: You haven't placed an order yet
fr: Vous n'avez pas encore passé de commande

# no_products
source: Could not find any products...
fr: Aucun produit n'a été trouvé

source: Order placed
fr: Commande passée

# checkout_proceed
source: Proceed to checkout ({quantity} items)
fr: Passer à la caisse ({quantity} produits)

# req_valid_email
source: Please enter a valid email!
fr: Veuillez saisir un e-amil valide !

# req_field
source: This field is required!
fr: Ce champ est obligatoire !

# loading_products
source: Loading more products
fr: Chargement d'autres produits

source: Loaded wishlist
fr: Liste de souhaits chargée

# err_invalid_login
source: Invalid login information!
fr: Informations de connexion non valides

# err_server_connection
source: An error occured while connecting to the server!
fr: Une erreur s'est produite lors de la connexion au serveur !

# err_loading_product
source: An error occured while loading the product!
fr: Une erreur s'est produite lors du chargement du produit !

# err_loading_basket
source: An error occured while loading the basket!
fr: Une erreur s'est produite lors du chargement du panier !

# err_loading_wishlist
source: An error occured while loading the basket!
fr: Une erreur s'est produite lors du chargement de la liste de souhaits !
